//*****************************************************************************
//
// Имя файла    : 'motor_driver.h'
// Заголовок    : Драйвер двигателей
// Автор        : Барышников Р. А.
// Контакты     : plexus_bra@rambler.ru
// Дата         : 09.04.2013
//
//*****************************************************************************

#ifndef _MOTOR_DRIVER_H
#define _MOTOR_DRIVER_H

// =============================================================================
//                                Костанты
// =============================================================================

	// Номера линий gpio
	// Для ODROID-X, gpio114 - 30 вывод
	#define		MD_LEFT		114
	// Для ODROID-X, gpio115 - 18 вывод
	#define		MD_RIGHT	115
	// Для ODROID-X, gpio105 - 34 вывод
	#define		MD_KEY		105
	// Для ODROID-X, gpio87 - 31 вывод
	#define		MD_BACK		87
	// Для ODROID-X, gpio96 - 42 вывод
	#define		MD_FORWARD	96

// =============================================================================
//                                Классы
// =============================================================================

class CMotorDriver
{
	public:
		// Конструктор
		CMotorDriver();
		// Инициализация
		void Init	(void);
		// Установка линии в "1"
		int SetGPIO (int gpio);
		// Установка линии в "0"
		int ClrGPIO	(int gpio);
		// Инвертирование линии
		int InvGPIO	(int gpio);
};

// =============================================================================
//                          Внешние зависимости
// =============================================================================
	
	extern CMotorDriver		mDriver;

#endif // _MOTOR_DRIVER_H
