//*****************************************************************************
//
// Имя файла    : 'wheel_controll.h'
// Заголовок    : Управление платформой
// Автор        : Барышников Р. А.
// Контакты     : plexus_bra@rambler.ru
// Дата         : 09.04.2013
//
//*****************************************************************************

#ifndef _WHEEL_CONTROLL_H
#define _WHEEL_CONTROLL_H

// =============================================================================
//                                Костанты
// =============================================================================

	// Номера линий gpio
	// Для ODROID-X, gpio114 - 30 вывод
	#define		MD_LEFT		114
	// Для ODROID-X, gpio115 - 18 вывод
	#define		MD_RIGHT	115
	// Для ODROID-X, gpio105 - 34 вывод
	#define		MD_KEY		105
	// Для ODROID-X, gpio87 - 31 вывод
	#define		MD_BACK		87
	// Для ODROID-X, gpio96 - 42 вывод
	#define		MD_FORWARD	96

// =============================================================================
//                             Типы/Структуры
// =============================================================================

	// Основные команды движения
	enum ECommandWheel
	{
		FORWARD = 0,
		STOP    = 1,
		BACK    = 2,
		LEFT    = 3,
		RIGHT   = 4,
		CENTER  = 5
	};

// =============================================================================
//                           Прототиаы функций
// =============================================================================

	// Инициализация gpio
	void WCInit (void);
	// Выполнение команды
	void WCCommand(ECommandWheel cmd);

#endif // _WHEEL_CONTROLL_H
